Саракташ2/src/Catalogs/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыЗаказов</name>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отменен</name>
      <description>Отменен</description>
    </items>
  </predefined>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварСписывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оптовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПоЗаказуЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьЗадолженность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварРезервируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварРезервируетсяДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВОтчетеПоВозвратам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборКурьерки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DPD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Саракташ2/src/Catalogs/СтатусыЗаказов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветОбъекта = Объект.Ссылка.Цвет.Получить();
	ШрифтОбъекта = Объект.Ссылка.Шрифт.Получить();
	
	Цвет = ?(Параметры.Ключ.Пустая() ИЛИ ЦветОбъекта = Неопределено,Новый Цвет(0,0,0),ЦветОбъекта);
	Шрифт = ?(Параметры.Ключ.Пустая() ИЛИ ШрифтОбъекта = Неопределено,Новый Шрифт("Обычный шрифт текста"),ШрифтОбъекта);   
	
	//Элементы.IDНаСайте.ТолькоПросмотр = НЕ Объект.Предопределенный;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(?(Цвет = Новый Цвет(0,0,0),Неопределено,Цвет));
	ТекущийОбъект.Шрифт = Новый ХранилищеЗначения(?(Шрифт = Новый Шрифт("Обычный шрифт текста"),Неопределено,Шрифт));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененЭлементСтатусЗаказа");
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Цвет = Новый Цвет(0,0,0);
	
КонецПроцедуры

&НаКлиенте
Процедура ШрифтОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Шрифт = Новый Шрифт("Обычный шрифт текста"); 
	
КонецПроцедуры
